Revit 2024 API
ParameterTypeId.EllipseXParam Property
 "X-Radius Value for Ellipse (for Use with XAML Data Template example)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EllipseXParam { get; }
Visual Basic
Public Shared ReadOnly Property EllipseXParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EllipseXParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace